#include <stdio.h>

int main() {
  int a = 10, b = 18;
  printf("a = %d, b = %d\n", a, b);

  a = a+b; // a = 28, b = 18
  b = a-b; // a = 28, b = 10
  a = a-b; // a = 18, b = 10
  printf("a = %d, b = %d\n", a, b);

  a = a^b;
  // a = 18 = 00010010
  // b = 10 = 00001010
  // a^b =    00011000 = 24
  b = a^b;
  // a = 24 = 00011000
  // b = 10 = 00001010
  // a^b =    00010010 = 18
  a = a^b;
  // a = 24 = 00011000
  // b = 18 = 00010010
  // a^b =    00001010 = 10
  printf("a = %d, b = %d\n", a, b);

  return 0;
}


/*
2017 [geekbrains] Основы языка Си
Урок 3. Бонус
06.c 5:00

Поменять местами две переменные без использования третьей переменной
*/
