#include <stdio.h>

int main() {
  printf("~5=%d\n", ~5); // -6 число со знаком
  printf("~5u=%u\n", ~5u); // 4294967290 число без знака

  printf("5<<2=%d\n", 5 << 2);
  printf("20>>1=%d\n", 20 >> 1);
  printf("5>>1=%d\n", 5 >> 1);
  printf("5>>2=%d\n", 5 >> 2);
  printf("5>>3=%d\n", 5 >> 3);
  printf("-5>>1=%d\n", -5 >> 1);
  printf("-5>>2=%d\n", -5 >> 2);
  printf("-5>>3=%d\n", -5 >> 3);
  printf("-5>>4=%d\n", -5 >> 4);
  return 0;
}


/*
2011 [Кораблин] Программирование на языке Си
Модуль 02 Операции.wmv
1:23
*/